<template>
  <div class="page">
    <h4>什么是闭包？</h4>
    <p>闭包是指有权访问另一个函数作用域中的变量的函数。</p>
    <h4>闭包的关键点</h4>
	<p>1.函数嵌套：闭包通常由一个嵌套函数创建。</p>
	<p>2.访问外部变量：内层函数能够访问其外层函数作用域中的变量。</p>
	<p>3.持久化作用域：即使外层函数已经执行完毕，其作用域中的变量仍然被内层函数保留。</p>
    <h4>闭包的作用</h4>
    <p>1. 读取函数内部的变量</p>
    <p>2. 让这些变量的值始终保持在内存中</p>
    <p>3. 封装变量</p>
    <p>4. 延长作用域</p>
    <h4>闭包的缺点</h4>
    <p>1. 闭包会使得函数中的变量都被保存在内存中，内存消耗很大，所以不能滥用闭包，否则会造成网页的性能问题。</p>
    <p>2. 闭包会在父函数外部改变父函数内部变量的值。</p>
    <p>3. 闭包会使得程序的逻辑变得复杂。</p>
    <h4>闭包的应用场景</h4>
    <p>1. 闭包可以用在定时器、事件监听、Ajax请求、回调函数、模块封装等场景。</p>
    <p>2. 闭包可以用来封装变量，防止变量污染全局。</p>
    <p>3. 闭包可以用来实现数据的私有化。</p>
    <p>4. 闭包可以用来实现函数的柯里化。</p>
    <p>5. 闭包可以用来实现单例模式。</p>
    <p>6. 闭包可以用来实现缓存。</p>
    <p>7. 闭包可以用来实现惰性函数。</p>
    <p>8. 闭包可以用来实现递归。</p>
    <p>9. 闭包可以用来实现函数的记忆化。</p>
    <p>10. 闭包可以用来实现函数的柯里化。</p>
    <p>11. 闭包可以用来实现函数的组合。</p>
  </div>
</template>
<script setup>
</script>
<style lang='scss' scoped>
p{
    text-align: left;
}
</style>